package com.sunyard.sunfintech.thirdparty.utils;

import java.util.HashMap;
import java.util.Map;

public class BobEpayCode {
    public static final Map<String, String> BobEpayCode = new HashMap<String, String>() {
        private static final long serialVersionUID = 1L;
        {
            put("000000", "1"); //交易成功
            put("999999", "2"); //其它错误
            put("001001", "2"); //对账文件未生成
            put("001002", "2"); //验证码已过期
            put("001003", "0"); //验证码错误
            put("020513", "2"); //验证码错误次数过多
            put("013006", "2"); //已挂失卡
            put("013004", "2"); //无效卡号
            put("013009", "2"); //无此账户
            put("013008", "2"); //余额不足
            put("013013", "2"); //超出提款限额
            put("013012", "2"); //不允许持卡人进行的交易
            put("013011", "2"); //密码错
            put("012012", "2"); //付款行故障
            put("012010", "2"); //付款行未开通业务
            put("012017", "2"); //单笔交易金额超过单笔金额上限
            put("012018", "2"); //单笔交易金额低于单笔金额下限
            put("012015", "2"); //收款行故障
            put("013028", "0"); //系统忙，请稍后再提交
            put("013033", "0"); //无此原交易  30分钟内作为处理中，30分钟后当失败
            put("013031", "2"); //账号户名不符
            put("013030", "2"); //账号错误
            put("013014", "2"); //原始金额不正确
            put("013017", "2"); //账户已冻结
            put("013065", "2"); //户名错
            put("013063", "2"); //证件类型和证件号码未输
            put("013064", "2"); //账户不支持代收付
            put("027019", "0"); //通讯超时
            put("027096", "2"); //银行卡未绑定
            put("027113", "2"); //银行卡余额不足次数过多
            put("030001", "2"); //协议号无效
            put("030002", "2"); //协议未签订

        }
    };
}
